Revit 2024 API
RebarContainerItem.BarTypeId Property
 The identifier of the rebar bar type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ElementId BarTypeId { get; }
Visual Basic
Public ReadOnly Property BarTypeId As ElementId
	Get
Visual C++
public:
property ElementId^ BarTypeId {
	ElementId^ get ();
}
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace